#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # github_repository.example[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "github_repository" "example" {
      [32m+[0m [0m[1m[0mallow_auto_merge[0m[0m       = false
      [32m+[0m [0m[1m[0mallow_merge_commit[0m[0m     = true
      [32m+[0m [0m[1m[0mallow_rebase_merge[0m[0m     = true
      [32m+[0m [0m[1m[0mallow_squash_merge[0m[0m     = true
      [32m+[0m [0m[1m[0marchived[0m[0m               = false
      [32m+[0m [0m[1m[0mbranches[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdefault_branch[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdelete_branch_on_merge[0m[0m = false
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "My awesome codebase"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mfull_name[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mgit_clone_url[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mhtml_url[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mhttp_clone_url[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                   = "example"
      [32m+[0m [0m[1m[0mnode_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprivate[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mrepo_id[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mssh_clone_url[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msvn_url[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mvisibility[0m[0m             = "public"
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ricardo-f, Action: `pull_request`, Working Directory: ``, Workflow: `test`*